docs/content-org/doc.org
#+STARTUP: content
#+AUTHOR: Iris Garcia
#+HUGO_BASE_DIR: ../
#+HUGO_AUTO_SET_LASTMOD: t
#+OPTIONS: toc:nil

*** Toolchain
:PROPERTIES:
:EXPORT_FILE_NAME: dev/tools
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :asciinema true
:END:
**** [[https://golang.org/][Go]]
The open source programming language Go will be used to develop the
whole project, mainly because I want to try a new language and this
one is becoming quite popular nowadays.

**** [[https://github.com/gin-gonic/gin][Gin]]
Gin is a HTTP web framework written in Go (Golang). It features a
Martini-like API with much better performance -- up to 40 times
faster.

It is very well documented and provides many handy features like
authentication, data validation and a configurable logger out of the
box.

**** [[https://magefile.org/][Mage]]
Mage is a make/rake-like build tool using Go. You write plain-old go
functions, and Mage automatically uses them as Makefile-like runnable
targets.

Mage has no dependencies outside the Go standard library; in this
project it is going to be used to automate every possible process
like:
1. ~mage test~: run tests and its code coverage.
2. ~mage build~: build a binary of the project.
3. ~mage install~: installs the built binary under /usr/local/bin.
4. ~mage start~: starts the API HTTP server.
5. ~mage startdev~: bootstraps a dev environment.


**** [[https://mariadb.com/][MariaDB]]
The relational database engine MariaDB has been choosen to persist the
data, it is OpenSource and fulfills the requirements.

**** Test-driven development (TDD & BDD)
Go has support for testing built in to its toolchain which will be used to cover
unit and integration tests with the help of [[https://github.com/stretchr/testify][testify]] for the
assertions.

[[https://github.com/onsi/ginkgo][Ginkgo]] will be used as a BDD testing framework and [[https://github.com/onsi/gomega][Gomega]] as a
matcher library.

**** [[https://github.com/OAI/OpenAPI-Specification/][OpenAPI]]
This project will follow the OpenAPI Specification to document its API
endpoints, probably using swagger to parse the specifications and
generate a static site.

